## DESAFIO - INTRODUCCION AL AMBIENTE DE TRABAJO

<ul> 
    <li> Constanza Córdova </li>
</ul>

## Desafío 1: Hola Mundo

In [13]:
print('Hola Mundo, esta es mi primera incursión en Python')

Hola Mundo, esta es mi primera incursión en Python

## Desafío 2: Ingreso de variables

In [24]:
name = 'Constanza'
edad = 26
hobbies = ['Trekking','Acampar', 'Pintar']
mascota = False

## Desafío 3: Imprimiendo Variables

### Imprima cada variable creada, acceda al segundo elemento de su lista

In [28]:
print(name, edad, hobbies[1], mascota)

Constanza 26 Acampar False

### Pida los tipos de datos asociados

In [27]:
print(type(name), type(edad), type(hobbies[1]), type(mascota))

<class 'str'> <class 'int'> <class 'str'> <class 'bool'>

### Interpole los datos en un método print para generar una presentación sobre usted.

In [29]:
print(f"Mi nombre es {name}, tengo {edad} años, mis hobbies son {hobbies}, el valor booleano de mascota es {mascota}")

Mi nombre es Constanza, tengo 26 años, mis hobbies son ['Trekking', 'Acampar', 'Pintar'], el valor booleano de mascota es False

## Desafío 4

In [30]:
print('Estaba la pájara pinta sentada en el verde limón')

Estaba la pájara pinta sentada en el verde limón

Falla 1: Faltaba cerrar texto con comilla

In [41]:
print('Mi nombre es', name, 'y tengo' ,edad, 'años')

Mi nombre es Constanza y tengo 26 años

Falla 2: Error en separar los argumentos, los argumentos deben separarse por comas

In [ ]:
import pandas as pd
import numpy as np

Falla 3: Error al escribir el nombre de las librerias

In [31]:
"Ornitorrinco" + str(45)

'Ornitorrinco45'

Falla 4: Error al concatenar un string con un entero

## Desafío 5: Utilizando pandas y numpy

#### Importar pandas y numpy, importar archivo flights.csv

In [42]:
import pandas as pd
import numpy as np

df = pd.read_csv('flights.csv')

#### Solicite las primeras y últimas 5 observaciones de la tabla de datos

In [43]:
df.head(5)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [44]:
df.tail(5)

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

#### Utilice describe para obtener las medidas univariadas de la columna year

In [45]:
df['year'].describe()

count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
25%      1951.750000
50%      1954.500000
75%      1957.250000
max      1960.000000
Name: year, dtype: float64

#### Utilice value_counts para obtener la frecuencia de meses y años de la tabla

In [46]:
df['year'].value_counts()

1960    12
1959    12
1958    12
1957    12
1956    12
1955    12
1954    12
1953    12
1952    12
1951    12
1950    12
1949    12
Name: year, dtype: int64

In [47]:
df['month'].value_counts()

August       12
September    12
November     12
June         12
July         12
October      12
March        12
December     12
May          12
April        12
February     12
January      12
Name: month, dtype: int64

#### Guarde en variables las primeras y últimas 15 observaciones de la tabla.

In [13]:
top_15 = df.head(15)
top_15

    year      month  passengers
0   1949    January         112
1   1949   February         118
2   1949      March         132
3   1949      April         129
4   1949        May         121
5   1949       June         135
6   1949       July         148
7   1949     August         148
8   1949  September         136
9   1949    October         119
10  1949   November         104
11  1949   December         118
12  1950    January         115
13  1950   February         126
14  1950      March         141

In [15]:
last_15 = df.tail(15)
last_15

     year      month  passengers
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

#### Solicite la media, mediana y desviación estandar de la cantidad de pasajeros utilizando los métodos de numpy

#### Para Dataframe:

In [21]:
media = np.mean(df['passengers'])
mediana = np.median(df['passengers'])
desv_std = np.std(df['passengers'])

print( media, mediana, desv_std)

280.2986111111111 265.5 119.54904153277148

#### Para las primeras 15 observaciones:

In [38]:
media = np.mean(top_15['passengers'])
mediana = np.median(top_15['passengers'])
desv_std = np.std(top_15['passengers'])
print( media, mediana, desv_std)

126.8 126.0 12.681745410891462

#### Para las últimas 15 observaciones:

In [37]:
media = np.mean(last_15['passengers'])
mediana = np.median(last_15['passengers'])
desv_std = np.std(last_15['passengers'])
print( media, mediana, desv_std)

459.2 432.0 75.29426715671431

Comentarios:

Se observa que en las últimas 15 observaciones la media de pasajeros fue mayor en relación a la muestra general y los primeros 15 meses. 

Además se observa que la desviación estándar del número de pasajeros en la muestra de las primeras 15 observaciones es menor en relación a la muestra general y las últimas 15 observaciones.

De los datos se decude que a medida que aumentan los años, la cantidad de pasajeros incrementa.